src/InformationRegisters/ПрефиксацияОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ПрефиксацияОбъектов</Name>
			<Comment>Префиксация объектов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Шаблон</Name>
					<Comment>Шаблон префикса</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПоУмолчанию</Name>
					<Comment>По умолчанию</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Имя объекта метаданных</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ПрефиксацияОбъектов/Ext/ManagerModule.bsl
// Модуль менеджера регистра сведений "Префиксация объектов"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура сверяет список метаданных со списком регистра и удаляет или добавляет необходимые записи.
//
Процедура ВыполнитьНачальноеЗаполнение() Экспорт
	
	// сформирует текущую таблицу метаданных конфигурации
	ТаблицаМетаданных = Новый ТаблицаЗначений;
	ТаблицаМетаданных.Колонки.Добавить("Объект",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(150)));
	ТаблицаМетаданных.Колонки.Добавить("ЕстьРегламентированныйУчет",Новый ОписаниеТипов("Булево"));
	
	Для Каждого Справочник Из Метаданные.Справочники Цикл
		НоваяСтрока                            = ТаблицаМетаданных.Добавить();
		НоваяСтрока.Объект                     = Справочник.ПолноеИмя();
	КонецЦикла;
	
	Для Каждого Документ Из Метаданные.Документы Цикл
		НоваяСтрока                            = ТаблицаМетаданных.Добавить();
		НоваяСтрока.Объект                     = Документ.ПолноеИмя();
		ЭлементВСоставе = Метаданные.ОбщиеРеквизиты.РегламентированныйУчет.Состав.Найти(Документ);
		Если ЭлементВСоставе <> Неопределено Тогда
			Если ЭлементВСоставе.Использование = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Использовать Тогда
				НоваяСтрока.ЕстьРегламентированныйУчет = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// получим расхождения
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТаблицаМетаданных", ТаблицаМетаданных);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПрефиксацияОбъектов.Объект                     КАК Объект,
	|	ПрефиксацияОбъектов.ЕстьРегламентированныйУчет КАК ЕстьРеглУчет
	|ПОМЕСТИТЬ ТаблицаМетаданных
	|ИЗ
	|	&ТаблицаМетаданных КАК ПрефиксацияОбъектов
	|;
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТаблицаМетаданных.Объект, """") КАК ОбъектМетаданных,
	|	ЕСТЬNULL(ПрефиксацияОбъектов.Объект, """") КАК Объект,
	|	ЕСТЬNULL(ТаблицаМетаданных.ЕстьРеглУчет, ЛОЖЬ) КАК ЕстьРеглУчет
	|ИЗ
	|	ТаблицаМетаданных КАК ТаблицаМетаданных
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.ПрефиксацияОбъектов КАК ПрефиксацияОбъектов
	|		ПО ТаблицаМетаданных.Объект = ПрефиксацияОбъектов.Объект
	|ГДЕ
	|	(ЕСТЬNULL(ТаблицаМетаданных.Объект, """") = """"
	|			ИЛИ ЕСТЬNULL(ПрефиксацияОбъектов.Объект, """") = """")";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	// удаляем или добавляем записи
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ПустаяСтрока(Выборка.ОбъектМетаданных) Тогда
			// удалим запись
			Менеджер = РегистрыСведений.ПрефиксацияОбъектов.СоздатьМенеджерЗаписи();
			Менеджер.Объект = Выборка.Объект;
			Менеджер.Удалить();
			Продолжить;
		КонецЕсли;
		
		Если ПустаяСтрока(Выборка.Объект) Тогда
			ЗначениеШаблона = ?(Выборка.ЕстьРеглУчет,"[П]","[О]");
			
			// добавляем строку
			Менеджер = РегистрыСведений.ПрефиксацияОбъектов.СоздатьМенеджерЗаписи();
			
			Менеджер.Объект      = Выборка.ОбъектМетаданных;
			Менеджер.Шаблон      = ЗначениеШаблона;
			Менеджер.ПоУмолчанию = ЗначениеШаблона;
			Менеджер.Записать(Истина);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры // ВыполнитьНачальноеЗаполнение()

// устанавливает все шаблоны записи регистра в значение по умолчанию
Процедура ВосстановитьЗначенияПоУмолчанию() Экспорт
	НаборЗаписей = РегистрыСведений.ПрефиксацияОбъектов.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.Шаблон = Запись.ПоУмолчанию;
	КонецЦикла;
	НаборЗаписей.Записать(Истина);
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли
